; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	image1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star6)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star6)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
)
(:goal (and
	(pointing satellite2 Phenomenon8)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 infrared3)
	(have_image Star10 spectrograph0)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 infrared3)
	(have_image Planet13 image1)
	(have_image Star14 image1)
	(have_image Star15 spectrograph2)
	(have_image Planet16 image1)
))

)

; plan
1. (turn_to satellite2 groundstation7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation7)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite2 instrument5 groundstation7)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite2 planet12 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet12)
   goals met: 0 of 10
5. (take_image satellite2 planet12 instrument5 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 1 of 10
6. (turn_to satellite2 phenomenon11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 10
7. (turn_to satellite0 groundstation4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 10
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
9. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 10
10. (take_image satellite2 phenomenon11 instrument5 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 2 of 10
11. (turn_to satellite0 planet13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet13)
   goals met: 2 of 10
12. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 3 of 10
13. (turn_to satellite0 planet16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet16)
   goals met: 3 of 10
14. (take_image satellite0 planet16 instrument0 image1)
   added: (have_image planet16 image1)
   goals met: 4 of 10
15. (turn_to satellite0 star10 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star10)
   goals met: 4 of 10
16. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 5 of 10
17. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 5 of 10
18. (take_image satellite0 star14 instrument0 image1)
   added: (have_image star14 image1)
   goals met: 6 of 10
19. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 6 of 10
20. (take_image satellite0 star15 instrument0 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 7 of 10
21. (turn_to satellite2 planet9 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet9)
   goals met: 7 of 10
22. (take_image satellite2 planet9 instrument5 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 8 of 10
23. (turn_to satellite2 phenomenon8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon8)
   goals met: 9 of 10
24. (take_image satellite2 phenomenon8 instrument5 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 10 of 10
